<script setup lang="ts">
  import WelcomeItem from './WelcomeItem.vue'
</script>

<template>
  <div class="welcome">
    Приложение позволяет отслеживать свой водный баланс, обмен веществ и расход калорий
  </div>
  <WelcomeItem>
    <template #heading>Настройки</template>

    Введите свои рост, вес, возраст и пол для правильного расчёта параметров. Так же можно задать желаемую калорийность.
  </WelcomeItem>

  <WelcomeItem>
    <template #heading>Водный баланс</template>

    Расчитывает необходимое потребеление воды в день. Строит график потребеления воды по дням и линеный график необходимого потребления воды.<br/>
    На одну дату можно добавлять несколько значений воды.<br/>
    В перспективе развития приложения можно будет добавлять не только воду, но и жидкости понижающие балас воды, такие как чай, кофе и т.д.
  </WelcomeItem>

  <WelcomeItem>
    <template #heading>Активность</template>

    Расчитывает необходимое потребеление калорий для поддержания веса по формуле Маффина-Джеора с учетом физической нагрузки.<br/>
    Строит график расхода калорий по дням и линеный график рассчитанной калорийности. На одну дату можно добавлять несколько значений.
  </WelcomeItem>

  <WelcomeItem>
    <template #heading>Калорийность</template>

    Строит график потребляемых калорий по дням и линеный график желаемой калорийности если он задан в настройках.<br/>
    На одну дату можно добавлять несколько продуктов. Можно добавлять новые продукты, если их нет в списке продуктов.
  </WelcomeItem>
</template>

<style scoped>
  .welcome {
    text-align: center;
    font-size: 1.1rem;
    color: rgba(94, 53, 177, 1);
    padding: 1rem 0;
  }
</style>
